examples/buoyantCavity/constant/physicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      physicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       28.96;
    }
    thermodynamics
    {
        Cp              1004.4;
        Hf              0;
    }
    transport
    {
        mu              1.831e-05;
        Pr              0.705;
    }
}


// WallHeatFluxIncompressible related info

viscosityModel 	Newtonian;

nu 			nu [0 2 -1 0 0 0 0] 1.516e-5;
Pr              	Pr [0 0 0 0 0 0 0] 0.705;
Prt             	Prt [0 0 0 0 0 0 0] 0.85;
Cp0             	Cp0 [0 2 -2 -1 0 0 0] 1004.4;
rho0            	rho0 [1 -3 0 0 0 0 0] 1.204;




// ************************************************************************* //
