examples/buoyantCavity/0/wallGradT
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      wallGradT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    topAndBottom
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            calculated;
        value           uniform 0;
    }
    hot
    {
        type            calculated;
        value           nonuniform List<scalar> 
2250
(
13585.5
13585.5
13585.5
13585.5
13585.5
13585.5
13585.5
13585.5
...
)
;
    }
    cold
    {
        type            calculated;
        value           nonuniform List<scalar> 
2250
(
-4467.11
-4467.11
-4467.11
-4467.11
-4467.11
-4467.11
-4467.11
-4467.11
...
)
;
    }
}


// ************************************************************************* //
